In [1]:
import pandas as pd
import numpy as np

# HW2: Collecting and Exploring Data

## instructions

our course will be using an automatic grading system. <br>
after each question there will appear a code block with some prepared code to add your answer to a dictionary that will be sent to the course server for grading. <br>
please do not edit any code other than in placeholders marked `#### your code here ####` <br>
__don't forget to run the code block after you write your answer.__


you can add code blocks wherever you want in order to interact with datasets and play with your own code. <br>
in the next code block plase fill in your id number and email account in the appropriate placees. <br>
and __don't forget to run the block!__

In [2]:
ans = {}
ans['HW'] = 'HW2'
ans['id_number'] = 307923383

## pandas basics
#### Q1) Data formats: In Python, the object pandas.DataFrame stores a rectangular data structure, and the object Dictionary is flexible like a JSON object. In class we used `pandas.DataFrame.from_dict(mydict,orient="index")` to transform a Dictionary of dictionaries into a DataFrame. What is required for this operation to give the desired outcome: 

    1. That every dictionary inside mydict has elements with the same names
    2. That there is only one dictionary inside mydict
    3. That each dicotionary inside mydict has a single element
    4. This function will always give a DataFrame which is equivalent to mydict

In [3]:
# 1. That every dictionary inside mydict has elements with the same names - NOPE!
# 2. That there is only one dictionary inside mydict - NOPE
# 3. That each dicotionary inside mydict has a single element - NOPE
mydict = {
    'one' : {
        'different_name': 1,
        'two': 2
    },
    'two' : {
        'one': 1,
        'two': 2
    },
    'three' : {
        'one': 1,
        'two': 2
    }
}

df = pd.DataFrame.from_dict(mydict, orient='index'); df

       different_name  two  one
one               1.0    2  NaN
three             NaN    2  1.0
two               NaN    2  1.0

In [4]:
mydict = {
    'one' : {
        'different_name': 1,
        'two': 2
    },
    'two' : {
        'one': 1,
        'two': [1,2,3]
    },
    'three' : {
        'one': 1,
        'two': {
            'how': {
                'far' : {
                    'can we go??': "very"
                }
            }
        }
    }
}

df = pd.DataFrame.from_dict(mydict, orient='index'); df

       different_name                                        two  one
one               1.0                                          2  NaN
three             NaN  {'how': {'far': {'can we go??': 'very'}}}  1.0
two               NaN                                  [1, 2, 3]  1.0

In [5]:
ans['Q1'] = 4

## Scraping

Consider the following html snippet:

```python    
    html_doc = """

    <html><head><title>The Dormouse's story</title></head>
    <body>
    <p class="title"><b>The Dormouse's story</b></p>

    <p class="story">Once upon a time there were three little sisters; and their names were
    <a href="http://example.com/elsie" class="sister" id="link1">Elsie</a>,
    <a href="http://example.com/lacie" class="sister" id="link2">Lacie</a> and
    <a href="http://example.com/tillie" class="sister" id="link3">Tillie</a>;
    and they lived at the bottom of a well.</p>

    <p class="story">Here is an image of Elsie: <a href="http://example.com/elsie"><img src = "elsie.png"></a></p>
    <p class="story">And here is an image of Lacie: <a href="http://example.com/lacie"><img src = "lacie.png"></a></p>
    """
```

#### Q2) We would like to get a list of the three little sisters names. Fill in the missing line of the following function:

```python    
    from bs4 import BeautifulSoup

    soup = BeautifulSoup(html_doc)

    def get_sisters_names(soup):
        # missing line 1 #
        return [sister.get_text() for sister in sisters]
    ```

   1. `sisters = soup.find_all('sister')` NOPE
   2. `sisters = soup.find_all('a')` NOPE
   3. `sisters = soup.find_all('a', {'class': 'sister'})` YES
   4. `sisters = soup.find_all(class = 'sister')` NOPE

In [6]:
from bs4 import BeautifulSoup

html_doc = """

    <html><head><title>The Dormouse's story</title></head>
    <body>
    <p class="title"><b>The Dormouse's story</b></p>

    <p class="story">Once upon a time there were three little sisters; and their names were
    <a href="http://example.com/elsie" class="sister" id="link1">Elsie</a>,
    <a href="http://example.com/lacie" class="sister" id="link2">Lacie</a> and
    <a href="http://example.com/tillie" class="sister" id="link3">Tillie</a>;
    and they lived at the bottom of a well.</p>

    <p class="story">Here is an image of Elsie: <a href="http://example.com/elsie"><img src = "elsie.png"></a></p>
    <p class="story">And here is an image of Lacie: <a href="http://example.com/lacie"><img src = "lacie.png"></a></p>
"""


soup = BeautifulSoup(html_doc)

def get_sisters_names(soup):
    sisters = soup.find_all('a', {'class' : 'sister'})    
    return [sister.get_text() for sister in sisters]

get_sisters_names(soup)

['Elsie', 'Lacie', 'Tillie']

In [7]:
ans['Q2'] = 3

#### Q3) Now we would like to get only the raw text of the Doormouse story, not including the title. Fill in the missing line of the following function:

```python    
    def get_story(soup):
        # missing line 1 #
        story = ''
        for p in paragraphs:
            # missing line 2 #
            if class_name == 'story':
                story += p.get_text() + ' '
        return ' '.join(story.split())
```

   1. line 1: `paragraphs = soup.find_all('p')`; line 2: `class_name = p['class'][0]`
   2. line 1: `paragraphs = soup.find_all('p', {'class': 'story'})`; line 2: `class_name = p['class']`
   3. line 1: `paragraphs = soup.find_all('p', {'class': 'story'})`; line 2: `class_name = p.find('class')[0]`
   4. line 1: `paragraphs = soup.find_all('story')`; line 2: `class_name = p.attr['class']`

In [8]:

# paragraphs = soup.find_all('p')
# class_name = p['class'][0]

# paragraphs = soup.find_all('p', {'class': 'story'})
# class_name = p['class']

# paragraphs = soup.find_all('p', {'class': 'story'})
# class_name = p.find('class')[0]


# paragraphs = soup.find_all('story')
# class_name = p.attr['class']

def get_story(soup):
    paragraphs = soup.find_all('p')
    story = ''
    for p in paragraphs:
        class_name = p['class'][0]
        if class_name == 'story':
            story += p.get_text() + ' '
    return ' '.join(story.split())

get_story(soup)

'Once upon a time there were three little sisters; and their names were Elsie, Lacie and Tillie; and they lived at the bottom of a well. Here is an image of Elsie: And here is an image of Lacie:'

In [9]:
ans['Q3'] = 1

#### Q4) What will be the result of calling the following function on our `soup` object (i.e. `does_something(soup)`)?

```python    
    def does_something(soup):
        return [e['src'].split('.')[0] for e in soup.find_all('img')]
```
   1. `['elsie.png', 'lacie.png']`
   2. `['elsie', 'lacie']`
   3. `{'src': ['elsie', 'lacie']}`
   4. The function will throw an exception on our `soup` object

In [10]:
def does_something(soup):
    return [e['src'].split('.')[0] for e in soup.find_all('img')]

does_something(soup)

['elsie', 'lacie']

In [11]:
ans['Q4'] = 2

#### Q5) The class notes contain code to scrape the Beatles discography and prepare a list of Albums. If we change the line 

 `if re.match(re.compile('^List of(.+?)albums'), header):` 
 
   to 
   
 `if re.match(re.compile('^List of EPs'), header):` 
   we get a list of EPs, however they only contain 17 EPs and not 21 as in the original list. What is the reason for this? 

   1. That the titles are repetitive and therefore the Python dictionary cannot distinguish between them
   2. That the html table only has 17 rows 
   3. That the other four don't have hyperlinks and therefore `title_col.find('a')` does not find them
   4. That the check `release_date is not None` fails for the other four

In [12]:
ans['Q5'] = 3

## Downloading and analyzing data 

Query Google Trends for searches of pasta compared to rice in the entire year 2018, worldwide. Check out the statistics by country and enjoy the interesting (and not surprising) georgraphic distribution. Download the statistics by country (DO NOT check the Include low search volume regions checkbox).

#### Q6) Calculate how many of the reported countries had more searches for pasta than rice: 

    1. 53
    2. 8
    3. 31
    4. 15

In [30]:
rice_vs_pasta = pd.read_csv('geoMap.csv')

In [31]:
rice_vs_pasta.shape

(250, 3)

In [32]:
rice_vs_pasta.head()

                             Country pasta: (2018) rice: (2018)
0                              Italy           99%           1%
1                         San Marino           NaN          NaN
2                          Singapore           20%          80%
3  Falkland Islands (Islas Malvinas)           NaN          NaN
4                             Latvia           NaN          NaN

In [33]:
rice_vs_pasta = rice_vs_pasta.dropna(axis=0)

In [34]:
rice_vs_pasta.shape

(30, 3)

In [35]:
rice_vs_pasta.columns.values

array(['Country', 'pasta: (2018)', 'rice: (2018)'], dtype=object)

In [36]:
rice_vs_pasta[rice_vs_pasta['pasta: (2018)'] > rice_vs_pasta['rice: (2018)']].shape

(15, 3)

In [41]:
rice_vs_pasta[['pasta: (2018)', 'rice: (2018)']] =  rice_vs_pasta[['pasta: (2018)', 'rice: (2018)']].applymap(lambda x: float(str(x).strip('%')) / 100.0)

In [42]:
rice_vs_pasta

                  Country  pasta: (2018)  rice: (2018)
0                   Italy           0.99          0.01
2               Singapore           0.20          0.80
5                  Turkey           0.99          0.01
9               Australia           0.43          0.57
14          United States           0.32          0.68
16            New Zealand           0.36          0.64
20                 Sweden           0.84          0.16
23                 Canada           0.37          0.63
27            Philippines           0.26          0.74
39         United Kingdom           0.46          0.54
42            Netherlands           0.88          0.12
45               Malaysia           0.19          0.81
48                Ireland           0.43          0.57
49                Belgium           0.90          0.10
50   United Arab Emirates           0.33          0.67
53                Denmark           0.77          0.23
62                 Norway           0.78          0.22
70                  Spain           0.91          0.09
83                 Brazil           0.97          0.03
85                 Poland           0.94          0.06
86           South Africa           0.46          0.54
96            Switzerland           0.76          0.24
97                  India           0.18          0.82
101              Pakistan           0.25          0.75
118                Mexico           0.88          0.12
150               Germany           0.74          0.26
152             Indonesia           0.46          0.54
164                Taiwan           0.70          0.30
186                France           0.64          0.36
207                 Japan           0.25          0.75

In [43]:
rice_vs_pasta[rice_vs_pasta['pasta: (2018)'] > rice_vs_pasta['rice: (2018)']].shape

(15, 3)

In [20]:
ans['Q6'] = 4

#### Q7) How many European countries in this list have more searches for rice than pasta?

    1. 0
    2. 2
    3. 4
    4. 6

In [44]:
rice_vs_pasta[rice_vs_pasta['pasta: (2018)'] < rice_vs_pasta['rice: (2018)']]

                  Country  pasta: (2018)  rice: (2018)
2               Singapore           0.20          0.80
9               Australia           0.43          0.57
14          United States           0.32          0.68
16            New Zealand           0.36          0.64
23                 Canada           0.37          0.63
27            Philippines           0.26          0.74
39         United Kingdom           0.46          0.54
45               Malaysia           0.19          0.81
48                Ireland           0.43          0.57
50   United Arab Emirates           0.33          0.67
86           South Africa           0.46          0.54
97                  India           0.18          0.82
101              Pakistan           0.25          0.75
152             Indonesia           0.46          0.54
207                 Japan           0.25          0.75

In [22]:
ans['Q7'] = 2

## data manipulations
Download from [Gapminder data repository](https://www.gapminder.org/data/) the life expectancy data for all countries in the years 1900-1999 (you may load a bigger dataset and concentrate on this part). Extract from this countries that have data for all years in the range 1900-1999. You should get 184 countries. Create for each of these the average age for each decade (1900-1909, 1910-1919,...), creating a matrix of 184\*10 averages.

__notice:__ there are many ways to aggregate the data correctly. you may use loops, numpy matrix operations and of course pandas, whatever you feel fit.

In [23]:
life_expectancy = pd.read_csv('life_expectancy_years.csv')

In [24]:
life_expectancy.shape

(187, 220)

In [25]:
life_expectancy.head()

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,Afghanistan,28.2,28.2,28.2,28.2,28.2,28.2,28.1,28.1,28.1,...,55.7,56.2,56.7,57.2,57.7,57.8,57.9,58.0,58.4,58.7
1,Albania,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,...,75.9,76.3,76.7,77.0,77.2,77.4,77.6,77.7,77.9,78.0
2,Algeria,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,...,76.3,76.5,76.7,76.8,77.0,77.1,77.3,77.4,77.6,77.9
3,Andorra,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,82.7,82.7,82.6,82.6,82.6,82.6,82.5,82.5,NaN,NaN
4,Angola,27.0,27.0,27.0,27.0,27.0,27.0,27.0,27.0,27.0,...,59.3,60.1,60.9,61.7,62.5,63.3,64.0,64.7,64.9,65.2

In [26]:
life_expectancy.columns.values

array(['country', '1800', '1801', '1802', '1803', '1804', '1805', '1806',
       '1807', '1808', '1809', '1810', '1811', '1812', '1813', '1814',
       '1815', '1816', '1817', '1818', '1819', '1820', '1821', '1822',
       '1823', '1824', '1825', '1826', '1827', '1828', '1829', '1830',
       '1831', '1832', '1833', '1834', '1835', '1836', '1837', '1838',
       '1839', '1840', '1841', '1842', '1843', '1844', '1845', '1846',
       '1847', '1848', '1849', '1850', '1851', '1852', '1853', '1854',
       '1855', '1856', '1857', '1858', '1859', '1860', '1861', '1862',
       '1863', '1864', '1865', '1866', '1867', '1868', '1869', '1870',
       '1871', '1872', '1873', '1874', '1875', '1876', '1877', '1878',
       '1879', '1880', '1881', '1882', '1883', '1884', '1885', '1886',
       '1887', '1888', '1889', '1890', '1891', '1892', '1893', '1894',
       '1895', '1896', '1897', '1898', '1899', '1900', '1901', '1902',
       '1903', '1904', '1905', '1906', '1907', '1908', '1909', '1910',
       '1911', '1912', '1913', '1914', '1915', '1916', '1917', '1918',
       '1919', '1920', '1921', '1922', '1923', '1924', '1925', '1926',
       '1927', '1928', '1929', '1930', '1931', '1932', '1933', '1934',
       '1935', '1936', '1937', '1938', '1939', '1940', '1941', '1942',
       '1943', '1944', '1945', '1946', '1947', '1948', '1949', '1950',
       '1951', '1952', '1953', '1954', '1955', '1956', '1957', '1958',
       '1959', '1960', '1961', '1962', '1963', '1964', '1965', '1966',
       '1967', '1968', '1969', '1970', '1971', '1972', '1973', '1974',
       '1975', '1976', '1977', '1978', '1979', '1980', '1981', '1982',
       '1983', '1984', '1985', '1986', '1987', '1988', '1989', '1990',
       '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998',
       '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006',
       '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014',
       '2015', '2016', '2017', '2018'], dtype=object)

In [27]:
life_expectancy = life_expectancy[['country'] + [str(i) for i in range(1900, 2000)]]

In [28]:
life_expectancy.head()

,country,1900,1901,1902,1903,1904,1905,1906,1907,1908,...,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999
0,Afghanistan,29.2,29.3,29.3,29.4,29.4,29.5,29.6,29.6,29.7,...,51.6,51.3,51.4,51.4,50.7,51.1,51.4,51.1,50.1,51.5
1,Albania,35.5,35.5,35.5,35.5,35.5,35.5,35.5,35.5,35.5,...,73.9,73.9,73.9,73.9,74.0,74.1,74.3,72.5,74.3,74.4
2,Algeria,30.1,30.2,30.3,31.3,25.3,28.0,29.5,29.4,29.3,...,71.0,71.4,71.7,72.0,72.1,72.3,72.8,73.0,73.1,73.5
3,Andorra,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,79.5,79.5,79.6,79.8,80.0,80.3,80.6,81.0,81.3,81.5
4,Angola,29.5,29.6,29.7,29.8,29.9,30.0,30.1,30.1,30.2,...,50.2,50.8,51.0,49.7,51.1,52.0,52.3,52.7,52.8,52.9

In [29]:
life_expectancy.shape

(187, 101)

In [30]:
life_expectancy = life_expectancy.dropna(axis=0)

In [31]:
life_expectancy.shape

(184, 101)

In [32]:
decades = np.array([ str(1900 + i*10) + '-'  + str(1909 + i*10) for i in range(10)])

In [33]:
decades = np.repeat(decades, 10); decades

array(['1900-1909', '1900-1909', '1900-1909', '1900-1909', '1900-1909',
       '1900-1909', '1900-1909', '1900-1909', '1900-1909', '1900-1909',
       '1910-1919', '1910-1919', '1910-1919', '1910-1919', '1910-1919',
       '1910-1919', '1910-1919', '1910-1919', '1910-1919', '1910-1919',
       '1920-1929', '1920-1929', '1920-1929', '1920-1929', '1920-1929',
       '1920-1929', '1920-1929', '1920-1929', '1920-1929', '1920-1929',
       '1930-1939', '1930-1939', '1930-1939', '1930-1939', '1930-1939',
       '1930-1939', '1930-1939', '1930-1939', '1930-1939', '1930-1939',
       '1940-1949', '1940-1949', '1940-1949', '1940-1949', '1940-1949',
       '1940-1949', '1940-1949', '1940-1949', '1940-1949', '1940-1949',
       '1950-1959', '1950-1959', '1950-1959', '1950-1959', '1950-1959',
       '1950-1959', '1950-1959', '1950-1959', '1950-1959', '1950-1959',
       '1960-1969', '1960-1969', '1960-1969', '1960-1969', '1960-1969',
       '1960-1969', '1960-1969', '1960-1969', '1960-1969', '1960-1969',
       '1970-1979', '1970-1979', '1970-1979', '1970-1979', '1970-1979',
       '1970-1979', '1970-1979', '1970-1979', '1970-1979', '1970-1979',
       '1980-1989', '1980-1989', '1980-1989', '1980-1989', '1980-1989',
       '1980-1989', '1980-1989', '1980-1989', '1980-1989', '1980-1989',
       '1990-1999', '1990-1999', '1990-1999', '1990-1999', '1990-1999',
       '1990-1999', '1990-1999', '1990-1999', '1990-1999', '1990-1999'],
      dtype='<U9')

In [34]:
decade_means = life_expectancy.iloc[:, life_expectancy.columns != 'country'].groupby(by=decades, axis=1).mean()

In [35]:
decade_means.shape

(184, 10)

#### Q8)  Find out all the cases that a country had a higher life expectancy in one decade compared to both the deacdes before and after. How many countries have at least one such decade? 

    1. 67
    2. 70
    3. 78
    4. 105

In [36]:
decade_means.head()

,1900-1909,1910-1919,1920-1929,1930-1939,1940-1949,1950-1959,1960-1969,1970-1979,1980-1989,1990-1999
0,29.47,27.799,30.58,31.14,31.69,34.80,41.87,45.77,43.97,51.16
1,35.50,33.900,35.50,40.33,45.11,57.36,65.57,69.91,72.91,73.92
2,29.43,30.570,31.40,34.48,36.64,48.98,54.57,59.43,66.91,72.29
4,29.92,28.870,31.62,32.49,34.59,39.05,45.22,49.40,50.07,51.55
5,33.70,32.580,36.81,45.12,53.55,60.26,64.77,68.32,72.28,74.39

In [37]:
(decade_means.diff(axis=1) > 0).multiply(decade_means.diff(axis=1, periods=-1) > 0).max(axis=1).sum()

/home/jonathansomer/.virtualenvs/ml/lib/python3.6/site-packages/pandas/core/computation/expressions.py:180: UserWarning: evaluating in Python space because the '*' operator is not supported by numexpr for the bool dtype, use '&' instead
  .format(op=op_str, alt_op=unsupported[op_str]))

67

In [38]:
ans['Q8'] = 1

#### Q9) In which decade the most countries experienced a decrease in life expectancy compared to the previous decade? (see if you can think of a reason)

   1. 1910's compared to 1900's
   2. 1920's compared to 1910's
   3. 1950's compared to 1940's
   4. 1980's compared to 1970's

In [39]:
(decade_means.diff(axis=1) < 0).sum(axis=0)

1900-1909      0
1910-1919    131
1920-1929      2
1930-1939     11
1940-1949     30
1950-1959      1
1960-1969      0
1970-1979     10
1980-1989      8
1990-1999     35
dtype: int64

In [40]:
ans['Q9'] = 1

## Summary Statistics

#### Q10) I have 101 observations for length of hospital stays, with maximum value 95 days, minimum 7 days, and average and median both 50 days. Now assume some software bug is causing the data to change from being measured in days to minutes (the length is multiplied by 24*60=1440). What is the minimal number of observations that will need to change before the average exceeds 100?

    1. 1
    2. 10
    3. 51
    4. 100

In [41]:
n = 101


i=1
((n-i)*50.0 + i*50.0*60*24)/n

762.3762376237623

In [42]:
ans['Q10'] = 1

#### Q11) In the same settings, what is the minimal number of observations that will need to change before the median exceeds 100? 

   1. 1
   2. 10
   3. 51
   4. 100

We will need that half of the observations have a value of 100

In [43]:
ans['Q11'] = 3

#### Q12) Assume the pollution in city A is exactly double that in city B every day. We measure the pollution in city A over 100 days and put it in a vector $x=(x_1,…x_{100})$ and in city B over the same 100 days giving $y=(y_1,…y_{100})$. We also consider the vectors $u=(log(x_1),…,log(x_{100}))$ and $v = (log(y_1),…,log(y_{100}))$. Which of the following holds: 

   1. $u_{10}$ (the 10th observation in $u$) is double $v_{10}$ 
   2. If $x_{10}$ > $y_{10}$ then $u_{10} < v_{10}$
   3. The dispersion of $x$ is bigger than of $y$, but the dispersion of $u$ is equal to that of $v$
   4. None of the above

1. is incorrect:
log(2x) = 1 + log(x)
2. is incorrect
log is monotonous
3. is correct
the mean increases by 1 exactly, the value of each increases by 1 too

In [44]:
x = np.random.rand(20)*100
y = 0.5*x

In [45]:
u = np.log(x)
v = np.log(y)

In [46]:
u[10]

2.970028822427543

In [47]:
v[10]

2.2768816418675977

In [48]:
np.std(u)

0.7169094180795238

In [49]:
np.std(v)

0.7169094180795237

In [50]:
np.std(x)

28.7072514890102

In [51]:
np.std(y)

14.3536257445051

In [52]:
ans['Q12'] = 3

## Basic Plots

#### Q13) Fill in the missing line to produce two boxplots of `y`, side by side, one for each value of `x`:

```python
    import pandas as pd
    import numpy as np
    import seaborn as sns
    import matplotlib.pyplot as plt

    sns.set()

    df = pd.DataFrame({
        'x': np.concatenate([np.tile('a', 100), np.tile('b', 100)]),
        'y': np.concatenate([np.random.normal(size = 100), np.random.exponential(size = 100)])})

    # missing line 1 #
```

   1. `sns.boxplot(df.x, df.y)`
   2. `sns.boxplot(df['x'], df['y'])`
   3. `sns.boxplot('x', 'y', data = df)`
   4. All of the above

In [53]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

sns.set()

df = pd.DataFrame({
    'x': np.concatenate([np.tile('a', 100), np.tile('b', 100)]),
    'y': np.concatenate([np.random.normal(size = 100), np.random.exponential(size = 100)])})

sns.boxplot('x', 'y', data = df)
plt.show()

sns.boxplot(df['x'], df['y'])
plt.show()

sns.boxplot(df.x, df.y)
plt.show()

In [54]:
ans['Q13'] = 4

# finish!

to submit your HW please run this last code block and follow the instructions. <BR>
this code will create a CSV file in the current directory on the azure notebooks project <br>
please download it and submit it through moodle

In [55]:
import pandas as pd
df_ans = pd.DataFrame.from_dict(ans, orient='index')
if df_ans.shape[0] == 15:
    df_ans.to_csv('{}_{}.csv'.format(ans['HW'],str(ans['id_number'])))
else:
    print("seems like you missed a question, make sure you have run all the code blocks")

SyntaxError: invalid syntax (<ipython-input-55-515358163cdd>, line 5)